---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
source: html/202508d1-3abe-eb28-0c7c-5f4859e9ed32.htm
---
# StructuralSectionGeneralT Methods

Returns size of the section boundary.